app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    params[:permissions].each do |p|
      @user.user_groups << UserGroup.find_by_name(p)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = 'cheesecurler@gmail.com', "updated_at" = '2012-12-02 23:18:35.077164' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    params[:permissions].each do |p|
      @user.user_groups << UserGroup.find(p)
    end
    @user.user_groups.uniq!

    respond_to do |format|
      if (current_user.is_password?(params[:curr_password]) or current_user.has_permission?('admin'))
        params[:user][:password] = params[:curr_password] if params[:user][:password] == ''
        if @user.update_attributes(params[:user])